# ElecticalEquipVoltage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElecticalEquipVoltage Property
ParameterTypeId Class See Also
---
"Voltage"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElecticalEquipVoltage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElecticalEquipVoltage As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElecticalEquipVoltage {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace